{
  "main": {
    "name":"Alan Fidelino",
    "occupation":"Web developer aspiring to land a full-time web development job focused on building User Interface design and development in ReactJS and Redux. As an avid learner of new technologies, I have made it my routine to always keep my mind active by studying daily from various sources to solidify the concepts I have learned about  web development. ",
    "description":"I am primarily a front end web developer specialising in ReactJS and a full stack web developer with working knowledge in using the Ruby on Rails framework",
    "image":"profilepic.jpg",
    "bio":"I am an avid learner of web technology and have dedicated the last 3 years studying and sharpening my skills and knowledge in web development frameworks and languages. With the availability of MOOCs (Massive Open Online Courses), learning has become a passion for me to improve myself and to always be keenly aware to start each day fresh with new challenges. Starting with Ruby on Rails, I embarked on my development studies getting familiarised with the MVC type architecture. With the rise of Javascript as the language of choice for both front end and backend, I have immersed myself in the study of web component based UI development using sound functional and object-oriented programming design patterns in the top 2 front end Javascript frameworks of today being Angular and React. I have to say learnability is my most important and desirable asset. Anyone who has worked with me knows that I always strive to be better at what I do and this same attitude is what I demonstrate daily in my studies about web development.",
    "email": "mailto:alanfidelino@yahoo.com.au",
    "phone": "tel:+61432193240",
    "address":{
      "street":"10 Marlowe Street",
      "city":"Wetherill Park, Sydney",
      "state":"New South Wales",
      "zip": "2164",
      "country":"Australia"
    },
    "website": "https://cfbikeberlinapp.herokuapp.com",
    "resumedownload":"http://something.com",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/freeflowing.reviews",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com/afide26",
        "className":"fa fa-twitter"
      },
      {
        "name":"google-plus",
        "url":"https://plus.google.com/u/0/105250946654496270708",
        "className":"fa fa-google-plus"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/alan-fidelino-25148213/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/afide26/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/afide26/",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"TylerMcGinnis.com - React Fundamentals",
        "degree":"React Basics, React Router",
        "graduated":"12 February 208",
        "description":"This course is part 1 of the entire React Training Program from https://tylermcginnis.com/. I only wanted to test out this course after reading the wonderful testimonials from the program's students and was hooked at the depth and wealth of knowledge in the available courses. I intend to finish this entire program to sharpen my skills in React and Redux.",
        "project" :"https://react-battle-e4a2f.firebaseapp.com/",
        "image":"../images/REACTDisplay.jpg",
        "repository":"https://github.com/afide26/github-battle"
      },
      {
        "school":"UDEMY - Advanced CSS and Sass: Take Your CSS to the Next Level!",
        "degree":"Advanced SASS, Block Element Modifier, Image Optimisation, Flexbox and Grid System",
        "graduated":"28 January 2018",
        "description":"This course covered 28 hours of lectures and code along experience on the latest technologies involving CSS. The project involved intensive coding exercises that was designed to expose the student to real word scenarios needed in styling modern websites without neglecting older browsers for compatibility. It delved into BEM, folder architecture for SASS, Flexbox and the latest Grid system layout disciplines in CSS.",
        "project" :"https://afide26.github.io/Nexter/",
        "image":"../images/sass.png",
        "repository":"https://github.com/afide26/Nexter"
      },
      {
        "school":"UDEMY - The Complete React Web Developer Course 2nd Edition",
        "degree":"Building Web Applications in React and Redux with Unit Testing",
        "graduated":"22 October 2017",
        "description":"This course covered 36+ hours of lectures and code along examples that covered the best practices in using ReactJS, Redux, Jest, Enzyme, React Router, Redux Thunk, Firebase, SASS and BEM. The sample application employed most of the advanced concepts in React and Redux whilst using asynchronous data fetching and updating of data hosted in Firebase.",
        "project" :"https://expensify-af.herokuapp.com/",
        "image":"../images/REACTDisplay.jpg",
        "repository":"https://github.com/afide26/expensify"
      },
      {
        "school":"UDEMY - Git a Web Developer Job: Mastering the Modern Workflow",
        "degree":"Building Web Applications Using Webpack, Gulp, BEM, PostCSS",
        "graduated":"04 September 2017",
        "description":"This course covered the best practice in organised workflow for web development including modules, style imports and image optimisation. The course is 15.5 hours long from a very knowledgable instructor. I refer to this course from time to time to refresh my knowledge in the proper ways of organising code and workflow.",
        "project" :"https://afide26.github.io/git-ts-site/",
        "image":"../images/git.png",
        "repository":"https://github.com/afide26/git-ts-site"
      },

      {
        "school":"UDEMY - Complete Node.JS Developer Course",
        "degree":"Complete Node.JS Developer Course",
        "graduated":"January 14, 2017",
        "description":"This project based course entailed coding 4 Node applications with varying complexities utilising MongoDB, Authentication, Socket.io, Automated Testing and Version Control. The capstone project involved Socket.io integration to demonstrate non-blocking server and client connection, enabling realt-time communication between users.",
        "project" :"https://udemynodechatapp.herokuapp.com",
        "image":"../images/NodeMongoExpress.jpg",
        "repository":"https://github.com/afide26/section-9-complete-nodejs-course"
      },

      {
        "school":"UDEMY - Getting Started with Angular2+ ",
        "degree":"Angular Web Development",
        "graduated":"May 10,2017",
        "description":"This introductory course to Angular Web Development covered component based web development in a very concise manner includeing sound fundamentals in how Angular approaches single page web applications.",
        "project" :"https://ngcribs.herokuapp.com/",
        "image":"../images/AngularApplication.jpg",
        "repository":"https://github.com/afide26/ngCribs"
      },
      {
        "school":"UDEMY - The Web Developer Bootcamp ",
        "degree":"The Web Developer Bootcamp",
        "graduated":"February 4, 2017",
        "description":"The course takes aspiring web developers into a plethora of web development topics like HTML, CSS, Javascript for both front end and back end, version control, No SQL databases, authenticaion, authorisation to prepare for a potential career in Web development. The online course entails tests, code challenges and sample web application as capstone project.",
        "project" :"https://afide-yelpcamp.herokuapp.com/",
        "image":"../images/NodeMongoExpress.jpg",
        "repository":"https://github.com/afide26/webbootcamp"
      },
      {
        "school":"CareerFoundry",
        "degree":"Full Stack Web Development Specialising in Ruby on Rails",
        "graduated":"November 2016",
        "description":"Six-month Web Development course designed for beginners to have the skills and knowledge to become an employable junior front-end and Ruby on Rails developer. The curriculum covers HTML, CSS, Javascript, jQuery, Bootstrap, AngularJS, Ruby, and Rails. By the end of the program, students will have built their first web app and will understand developer tools like Git and Heroku. The end project for this course is an online portfolio and an e-commerce web-application utilising Rails5 technology and Stripe as payment system.",
        "project" :"https://cfbikeberlinapp.herokuapp.com",
        "image":"../images/Rails.jpg",
        "repository":"https://github.com/afide26/cfcoursapp"
      },
      {
        "school":"UDEMY - Modern React with Redux",
        "degree":"Building Web Applications in React and Redux",
        "graduated":" ",
        "description":"The sample application was inspired by YouTube and coded in React. The landing page is a tribute to my childhood idol, Bruce Lee. Covered in this course are practical applications of ReactJS, React Router, React Forms, Redux Thunk, AJAX Requests and Deployment. ",
        "project" :"https://react-tube-bl.herokuapp.com/",
        "image":"../images/REACTDisplay.jpg",
        "repository":"https://github.com/afide26/ReactTube"
      }
    ],
    "work":[
      {
        "company":"Woolworths Group",
        "title":"Communications Specialist - Front End Web Developer",
        "years":"October 2012 - Present",
        "description":"I am a fulltime Communications Specialist with skills in digital media, graphic design and was tasked to develop our intranet site whilst enrolled in an online web development course. With the help of colleagues and mentors, I designed, developed and maintained the group IT website using the Ruby on Rails framework. With the need to move the existing site to a more secure platform in Adobe Experience Manager, I had a very good working relationship with our in house AEM development team as the front end web developer for our new team site."
      },
      {
        "company":"Sensis White Pages",
        "title":"Media Specialist/Online Specialist",
        "years":"April 2007 - October 2012",
        "description":"My role entailed providing detailed analysis of businesses being serviced by the top account executives in White Pages in order to match the digital and print solutions offered by the company to the client's business needs in terms of digital presence. Other roles include digital project management, online coaching and sharing of new trends in web technologies that helped the team in their digital knowledge. In my last few months with the company, I led the development of an integrated sales portal where sales staff can view their reports and notes together with their group sales in a project management capacity."
      }
    ],
    "passion":{ "description": "I am a voracious learner and have kept myself up to date with the most relevant skills in these demanding times. I have to say learnability is my most important and desirable skill. Anyone who has worked with me knows that I always strive to be better at what I do and this same attitude is what I demonstrate daily in my studies about web development. Most recently I have focused on learning Functional and Objective Programming in Javascript to be able to utilise these skills in my future career goals. My development is always geared towards striking a balance in gaining analytical and artistic knowledge that I use as tools of the trade."
    },
    "skills":[
      {
        "name":"Photoshop",
        "shortname": "Photoshop",
        "level":"90%"
      },

      {
        "name":"Illustrator",
        "shortname": "Illustrator",
        "level":"75%"
      },
      {
        "name":"CSS, Grid System and Flexbox Layouts",
        "shortname": "CSS",
        "level":"80%"
      },
      {
        "name":"SASS",
        "shortname": "Sass",
        "level":"80%"
      },
      {
        "name":"Post CSS",
        "shortname": "PostCSS",
        "level":"80%"
      },
      {
        "name":"HTML5",
        "shortname": "HTML5",
        "level":"90%"
      },
      {
        "name":"Javascript/ES6+",
        "shortname": "Javascript",
        "level":"80%"
      },
      {
        "name":"NodeJS",
        "shortname": "NodeJS",
        "level":"85%"
      },
      {
        "name":"AngularJS",
        "shortname": "AngularJS",
        "level":"80%"
      },
      {
        "name":"Angular2+",
        "shortname": "AngularTwoPlus",
        "level":"80%"
      },
      {
        "name":"ReactJS and Redux",
        "shortname": "React",
        "level":"80%"
      },
      {
        "name":"jQuery",
        "shortname": "jQuery",
        "level":"80%"
      },
      {
        "name":"Ruby and Ruby on Rails",
        "shortname": "Ruby",
        "level":"80%"
      },
      {
        "name":"NPM, Yarn",
        "shortname": "npm",
        "level":"75%"
      },
      {
        "name":"Gulp, Webpack",
        "shortname": "webtooling",
        "level":"75%"
      }
    ]
  },
  "testimonials":{
    "recommendations":[
      {
        "text":"I had the privilege of working with Alan in one of the challenging projects at Woolworths. Alan is proactive, result-oriented, responsible and technically sound person and he is always ready to put all his energy and time to get the job done. He has exceptional troubleshooting and analytical skills in Ruby, React and Javascript. He is a great asset to the company.",
        "user":"Saswat Mishra - AEM Lead at Woolworths",
        "link": "https://www.linkedin.com/in/alan-fidelino-25148213/"
      },
      {
        "text":"I had the pleasure of working with Alan in Woolworths. Alan is an exceptionally hard working professional. His ability to work under pressure and deliver a top class outcome is what makes him stand out from the crowd. He is an excellent communicator and has the ability to translate complex information in simple and exciting formats. Alan is a keen learner and is passionate about digital technology. He keeps reinventing himself by learning new skills and finding ways to use that in his role. I believe Alan's passion in the web/mobile development space holds him in good stead in this fast moving world. He will be a great asset to any organisation especially in the digital space.",
        "user":"Ani Nair - Senior Manager, Customer Experience Design ICare, Alan's previous boss, mentor and influencer",
        "link": "https://www.linkedin.com/in/alan-fidelino-25148213/"
      },
      {
        "text":"I had the pleasure of working with Alan while he was my colleague at Woolworths. During this time he was diligently learning two programming languages, Javascript and Ruby. Not only did he learn two development stacks but he would also find practical ways to implement what he had learnt to benefit the business. The crowning project was one in which he built the portal for Woolworths I.T. division. I respect Alan as he would go over and above his role consistently, finding new problems he could solve and helping others, finding best practice resolutions to whatever problem he was faced with. I would highly recommend Alan as a problem solver, team player and technologist.",
        "user":"Trent Shields - Founder and Lead Strategist at Dev Haus X, Alan's Web Development Mentor",
        "link": "https://www.linkedin.com/in/alan-fidelino-25148213/"
      }
    ]
  }
}
